## Passing Parameters in query

In [2]:
import sqlite3
db = sqlite3.connect('C:/Users/saya jahnavi/Desktop/CodingNinja/SQL _SS/schools.sqlite')
db

In [3]:
cur = db.cursor()
cur

In [5]:
sql_query = 'create table student_s (RollNumber int Primary Key, Name Text, Age int)'
cur.execute(sql_query)

In [6]:
cur.execute('Insert into student_s values (101, "Aman", 20)')

In [7]:
db.commit()   # only after this changes happen to our database.

In [9]:
cur.execute('Insert into student_s values (102, "Amit", 21)')

In [10]:
db.commit()

In [11]:
cur.execute('Insert into student_s values (103, "Mohit", 24)')

In [12]:
db.commit()

In [13]:
rollNumber = 104
Name = "Nikhil"
age = 34

# we have these three variables and we want to insert these values in my table student_s

cur.execute('Insert into student_s values(?, ?, ?)', (rollNumber, Name, age))  # we are placing all the variables in single parenhesis so it is tuple


# In sqlite we can use placeholder i,e. ? we can place this value wherever we want to provide value using our variables

In [14]:
db.commit()

In [15]:
# we want to insert threenew rows in our table

# we can take help of the method exectemany

values = [(105, "Nidhi", 20), (106, "Manisha", 21), (107, "Ankush", 22)]
cur.executemany('Insert into student_s values (?, ?, ?)', values)

In [16]:
db.commit()

In [17]:
# we can update values also

# we want to update age column

cur.execute('Update student_s set Age = 30')

In [18]:
db.commit()

In [19]:
cur.execute('Update student_s set Age = 20 where RollNumber = 102')

In [20]:
db.commit()

In [21]:
new_age = 50
cur.execute('Update student_s set Age = ? where RollNumber = 103', new_age)

ProgrammingError: parameters are of unsupported type

In [22]:
# we need to pass the variable in the form of tuple as we saw earlier
# If there is only one value then we have to mark comma explicitly to make this a tuple

new_age = 50
cur.execute('Update student_s set Age = ? where RollNumber = 103', (new_age, ))

In [23]:
db.commit()

## Fetch Data

In [24]:
# to extract each & every in our table student_s

cur.execute('select * from student_s')

In [25]:
# we can treat this cur(cursor object) as an iteratot over which we can iterate and get access of every row


for row in cur :
    print(row)

(101, 'Aman', 30)
(102, 'Amit', 20)
(103, 'Mohit', 50)
(104, 'Nikhil', 30)
(105, 'Nidhi', 30)
(106, 'Manisha', 30)
(107, 'Ankush', 30)

 There are few other methods with which we can fetch data from the table
 1. fetchone()
 2. fetchmany()
 3. fetchall()

In [26]:
# we need to call these  methods over our cursor object
# FETCHONE()

cur.execute('select * from student_s')
cur.fetchone()

(101, 'Aman', 30)

In [27]:
cur.execute('select * from student_s')
print(cur.fetchone())
print(cur.fetchone())

(101, 'Aman', 30)
(102, 'Amit', 20)

In [28]:
#FETCHMANY() 
# with which we can get n number of rows


cur.execute('select * from student_s')
print(cur.fetchmany(3))


# these 3 rows are returned as list of tuple

[(101, 'Aman', 30), (102, 'Amit', 20), (103, 'Mohit', 50)]

In [29]:
# If we wont pass any value to fetchmany( ) we should get only one row

cur.execute('select * from student_s')
print(cur.fetchmany())

[(101, 'Aman', 30)]

In [30]:
# FETCHALL()
# as name suggests we get each and every row of the table in a format of list of tuples

cur.execute('select * from student_s')
print(cur.fetchall())

[(101, 'Aman', 30), (102, 'Amit', 20), (103, 'Mohit', 50), (104, 'Nikhil', 30), (105, 'Nidhi', 30), (106, 'Manisha', 30), (107, 'Ankush', 30)]

In [32]:
# we can save the above in some variable and operate over it

cur.execute('select * from student_s')
ans = cur.fetchall()

In [33]:
ans

[(101, 'Aman', 30),
 (102, 'Amit', 20),
 (103, 'Mohit', 50),
 (104, 'Nikhil', 30),
 (105, 'Nidhi', 30),
 (106, 'Manisha', 30),
 (107, 'Ankush', 30)]

In [34]:
cur.execute('select * from student_s where RollNumber = 103')
print(cur.fetchmany(3))

[(103, 'Mohit', 50)]

In [36]:
cur.execute('select * from student_s where RollNumber > 103')
print(cur.fetchall())

[(104, 'Nikhil', 30), (105, 'Nidhi', 30), (106, 'Manisha', 30), (107, 'Ankush', 30)]

In [37]:
cur.execute('select * from student_s where Name like "A%"')
print(cur.fetchall())

[(101, 'Aman', 30), (102, 'Amit', 20), (107, 'Ankush', 30)]

## SQLite with pandas

In [38]:
import pandas as pd

In [39]:
# in order to read data in pandas data frame we need to call a method available in pandas 

data = pd.read_sql_query("select * from student_s", db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         102     Amit   20
2         103    Mohit   50
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

Advantages of using SQLite with pandas:

we dont have to use cursor object
we dont need call explicit fetchone() or fetchall() or fetchmany() to get the data
by calling the method pd.read_sql_query()  we are getting our data as a dataframe (we can do many operations on data frames easily

In [40]:
# we want evry row from this table where age= 30

data["Age"] == 30

0     True
1    False
2    False
3     True
4     True
5     True
6     True
Name: Age, dtype: bool

In [42]:
data[data["Age"] == 30]

   RollNumber     Name  Age
0         101     Aman   30
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [43]:
# with the help of pandas we can create new tables also

# lets create table faculty with columns id,name,course,salary

# firstly we can create a pandas dataframe

data = pd.DataFrame([[201, "Aman", "English", 20000], [202, "Komal", "Maths", 22000], [203, "Mahesh","Science", 23000 ]], 
                    columns = ["ID", "Name", "Course", "Salary"])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [44]:
# we want to convert this data frame into a table this can be done by calling a method 

data.to_sql("Faculty",db)

3

In [45]:
# using pandas we can convert dataframe to table and vice versa

# we can also update our table using pandas

data = pd.read_sql_query("select * from student_s", db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         102     Amit   20
2         103    Mohit   50
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [46]:
# now we want to add one more column to the table with name address

data = pd.read_sql_query("select * from student_s", db)
data["Address"] = "Test"
data

   RollNumber     Name  Age Address
0         101     Aman   30    Test
1         102     Amit   20    Test
2         103    Mohit   50    Test
3         104   Nikhil   30    Test
4         105    Nidhi   30    Test
5         106  Manisha   30    Test
6         107   Ankush   30    Test

In [ ]:
# we wnat to update our the table in our database for that we need to call a method 

data = pd.read_sql_query("select * from student_s", db)
data["Address"] = "Test"
data.to_sql("student", db, if_exists)